documentation refactor
